backend/controllers/SiteController.php

                'PERCENTAGE' => $serverInfo['memRealPercent'] . '%',
            ],
        ];
        $temp = [
            'CATEGORY' => CategoryModel::find()->count('id'),
            'COMMENT' => Comment::find()->count('id'),
            'USER' => User::find()->count('id'),
            'FRIEND_LINK' => FriendlyLink::find()->count('id'),
        ];
---
SELECT COUNT(id) FROM `qd_category`
SELECT COUNT(id) FROM `qd_comment`
SELECT COUNT(id) FROM `qd_user`
SELECT COUNT(id) FROM `qd_friendly_link`

        $statics = [
            'CATEGORY' => [
                $temp['CATEGORY'],
                $temp['CATEGORY'] ? number_format(CategoryModel::find()->where([
                        'between',
                        'created_at',
                        strtotime(date('Y-m-01')),
                        strtotime(date('Y-m-01 23:59:59') . " +1 month -1 day")
                    ])->count('id') / $temp['CATEGORY'] * 100, 2) : $percent
---
SELECT COUNT(id) FROM `qd_category` WHERE `created_at` BETWEEN 1588262400 AND 1590940799

            ],
            'USER' => [
                $temp['USER'],
                $temp['USER'] ? number_format(User::find()->where([
                        'between',
                        'created_at',
                        strtotime(date('Y-m-01')),
                        strtotime(date('Y-m-01 23:59:59') . " +1 month -1 day")
                    ])->count('id') / $temp['USER'] * 100, 2) : $percent
            ],
            'FRIEND_LINK' => [
                $temp['FRIEND_LINK'],
                $temp['FRIEND_LINK'] ? number_format(FriendlyLink::find()->where([
                        'between',
                        'created_at',
                        strtotime(date('Y-m-01')),
                        strtotime(date('Y-m-01 23:59:59') . " +1 month -1 day")
                    ])->count('id') / $temp['FRIEND_LINK'] * 100, 2) : $percent
---
SELECT COUNT(id) FROM `qd_user` WHERE `created_at` BETWEEN 1588262400 AND 1590940799
SELECT COUNT(id) FROM `qd_friendly_link` WHERE `created_at` BETWEEN 1588262400 AND 1590940799