<?php
return [
    'adminEmail' => 'admin@example.com',
    'user.apiTokenExpire' => 3*24*3600,
    //企服界小程序
    'qd_wechat' => [
        'appid' =>   'wxa63e1300f8d28184',
        'secret' =>   '870eeecd9af7dffdb641f00d84b7e94d'
    ],

    'params' => [
    -2 => '程序异常',
    -1 => '系统错误,请联系管理员',
    200 => '操作成功',
    100 => '操作失败',
    //小程序
    40029=>'code无效',
    45011=>'频率限制，每个用户每分钟100次',
    10001 => '缺少必要参数',
    10002 => '新增失败',
    10003 => '解析手机号失败',
    10004 => '验证码错误',
    10006 => '请勿重复授权',
    10007 => '没有可以删除的url!',
    10008 => '暂无企业信息！',
    10009 => '用户名或密码不正确!',
    10010 => '该用户名已被注册!',
]
];
